SiliconLabs/wfx-fullMAC-tools/Examples/STM32/uart_cli/Src/sl_wfx_cli/sl_wfx_cli.c
/**************************************************************************//**
 * Copyright 2018, Silicon Laboratories Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *****************************************************************************/

/* FreeRTOS includes. */
#include "cmsis_os.h"

/* Standard includes. */
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <stdbool.h>

/* FreeRTOS+CLI includes. */
#include "FreeRTOS_CLI.h"

/* LwIP includes. */
#include "lwip/netif.h"
#include "lwip/ip_addr.h"
#include "lwip/apps/lwiperf.h"

#include "sl_wfx.h"
#include "sl_wfx_cli.h"
#include "sl_wfx_host.h"
#include "lwip_common.h"
#include "stm32f4xx_hal.h"

#define SL_WFX_STATE_TO_BINARY(state)  \
  ((state & SL_WFX_STARTED) ? '1' : '0'), \
  ((state & SL_WFX_STA_INTERFACE_CONNECTED) ? '1' : '0'), \
  ((state & SL_WFX_AP_INTERFACE_UP) ? '1' : '0'), \
  ((state & SL_WFX_SLEEPING) ? '1' : '0'), \
  ((state & SL_WFX_POWER_SAVE_ACTIVE) ? '1' : '0') 

uint32_t iperf_ms_duration;
uint32_t iperf_bytes_transferred;
uint32_t iperf_bandwidth_kbitpsec;

void lwip_iperf_results (void *arg, enum lwiperf_report_type report_type,
                         const ip_addr_t* local_addr, u16_t local_port, const ip_addr_t* remote_addr, u16_t remote_port,
                         u32_t bytes_transferred, u32_t ms_duration, u32_t bandwidth_kbitpsec)
{
  iperf_ms_duration = ms_duration;
  iperf_bytes_transferred = bytes_transferred;
  iperf_bandwidth_kbitpsec = bandwidth_kbitpsec;
  printf("\r\nIperf Report:\r\n" );
  printf("Interval %d.%ds\r\n",(int)(ms_duration/1000),(int)(ms_duration%1000));
  printf("Bytes transferred %d.%dM\r\n",(int)(bytes_transferred/1024/1024),(int)((((bytes_transferred/1024)*1000)/1024)%1000));
  printf("%d.%d Mbps\r\n\r\n",(int)(bandwidth_kbitpsec/1024),(int)(((bandwidth_kbitpsec*1000)/1024)%1000));
}

/* Default parameters */
extern sl_wfx_context_t wifi;
extern char wlan_ssid[32];
extern char wlan_passkey[64];
extern sl_wfx_security_mode_t wlan_security;
extern char softap_ssid[32];
extern char softap_passkey[64];
extern sl_wfx_security_mode_t softap_security;
extern uint8_t softap_channel;          
/* Default parameters */
/*
* Implements the run-time-stats command.
*/
static portBASE_TYPE prvInitCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString );
static portBASE_TYPE prvScanCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString );
static portBASE_TYPE prvNetworkUpCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString );
static portBASE_TYPE prvNetworkDownCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString );
static portBASE_TYPE prvSoftApUpCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString );
static portBASE_TYPE prvSoftApDownCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString );
static portBASE_TYPE prvRssiCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString );
static portBASE_TYPE prvIPerfCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString );
static portBASE_TYPE prvPowerManagementModeCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString );
static portBASE_TYPE prvDevicePowerSaveCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString );
static portBASE_TYPE prvShutdownCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString );
static portBASE_TYPE prvResetCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString );
static portBASE_TYPE prvGetCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString );
static portBASE_TYPE prvSetCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString );

static const CLI_Command_Definition_t prvInitCommandDefinition =
{
  "init", /* The command string to type. */
  "init              : initialize the Wi-Fi chip\r\n",
  prvInitCommand, /* The function to run. */
  0
};

static const CLI_Command_Definition_t prvScanCommandDefinition =
{
  "scan", /* The command string to type. */
  "scan              : perform a Wi-Fi scan\r\n",
  prvScanCommand, /* The function to run. */
  0
};

static const CLI_Command_Definition_t prvNUpCommandDefinition =
{
  "nup", /* The command string to type. */
  "nup               : connect to the Wi-Fi access point with the information stored in wlan.all\r\n",
  prvNetworkUpCommand, /* The function to run. */
  0
};

static const CLI_Command_Definition_t prvNDoCommandDefinition =
{
  "ndo", /* The command string to type. */
  "ndo               : disconnect from the Wi-Fi access point\r\n",
  prvNetworkDownCommand, /* The function to run. */
  0
};

static const CLI_Command_Definition_t prvSUpCommandDefinition =
{
  "sup", /* The command string to type. */
  "sup               : start the SoftAP interface using the information store in softap.all\r\n",
  prvSoftApUpCommand, /* The function to run. */
  0
};

static const CLI_Command_Definition_t prvSDoCommandDefinition =
{
  "sdo", /* The command string to type. */
  "sdo               : stop the SoftAP interface\r\n",
  prvSoftApDownCommand, /* The function to run. */
  0
};

static const CLI_Command_Definition_t prvRssiCommandDefinition =
{
  "rssi", /* The command string to type. */
  "rssi              : retrieve the RSSI value in station mode\r\n"
  "rssi <mac>        : retrieve the client RSSI value in softAP mode\r\n",
  prvRssiCommand, /* The function to run. */
  -1
};

static const CLI_Command_Definition_t prvIPerfCommandDefinition =
{
  "iperf", /* The command string to type. */
  "iperf -c <ip>     : start a TCP iPerf client for 10 seconds\r\n"
  "iperf -s          : start a TCP iPerf server\r\n",
  prvIPerfCommand, /* The function to run. */
  -1
};

static const CLI_Command_Definition_t prvPowerManagementModeCommandDefinition =
{
  "powermode", /* The command string to type. */
  "powermode <m> <i> : configure the power management mode, m: mode, i: interval \r\n",
  prvPowerManagementModeCommand, /* The function to run. */
  2
};

static const CLI_Command_Definition_t prvDevicePowerSaveCommandDefinition =
{
  "powersave", /* The command string to type. */
  "powersave <on/off>: enable/disable the device power save mechanism\r\n",
  prvDevicePowerSaveCommand, /* The function to run. */
  1
};

