SiliconLabs/wfx-fullMAC-tools/Examples/STM32/uart_cli/Src/sl_wfx_cli/sl_wfx_cli.c
static const CLI_Command_Definition_t prvShutdownCommandDefinition =
{
  "shutdown", /* The command string to type. */
  "shutdown          : put the Wi-Fi chip in shutdown mode\r\n",
  prvShutdownCommand, /* The function to run. */
  0
};

static const CLI_Command_Definition_t prvResetCommandDefinition =
{
  "reset", /* The command string to type. */
  "reset             : reset the MCU\r\n",
  prvResetCommand, /* The function to run. */
  0
};

static const CLI_Command_Definition_t prvGetCommandDefinition =
{
  "get", /* The command string to type. */
  "get <param>       : get a parameter. For more info, type \"get help\"\r\n",
  prvGetCommand, /* The function to run. */
  1
};

static const CLI_Command_Definition_t prvSetCommandDefinition =
{
  "set", /* The command string to type. */
  "set <param> <val> : set a parameter value. For more info, type \"set help\"\r\n",
  prvSetCommand, /* The function to run. */
  -1
};

void vRegisterCLICommands( void )
{
  /* Register all the command line commands defined immediately above. */
  FreeRTOS_CLIRegisterCommand( &prvInitCommandDefinition );
  FreeRTOS_CLIRegisterCommand( &prvScanCommandDefinition );
  FreeRTOS_CLIRegisterCommand( &prvNUpCommandDefinition );
  FreeRTOS_CLIRegisterCommand( &prvNDoCommandDefinition );
  FreeRTOS_CLIRegisterCommand( &prvSUpCommandDefinition );
  FreeRTOS_CLIRegisterCommand( &prvSDoCommandDefinition );
  FreeRTOS_CLIRegisterCommand( &prvRssiCommandDefinition );
  FreeRTOS_CLIRegisterCommand( &prvIPerfCommandDefinition );
  FreeRTOS_CLIRegisterCommand( &prvPowerManagementModeCommandDefinition );	
  FreeRTOS_CLIRegisterCommand( &prvDevicePowerSaveCommandDefinition );
  FreeRTOS_CLIRegisterCommand( &prvShutdownCommandDefinition );	
  FreeRTOS_CLIRegisterCommand( &prvResetCommandDefinition );
  FreeRTOS_CLIRegisterCommand( &prvGetCommandDefinition );
  FreeRTOS_CLIRegisterCommand( &prvSetCommandDefinition );
}

static portBASE_TYPE prvInitCommand(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString)
{
  sl_status_t status;
  *pcWriteBuffer = 0;
  
  status = sl_wfx_init(&wifi);
  switch(status){
  case SL_STATUS_OK:
    wifi.state = SL_WFX_STARTED;
    sprintf(pcWriteBuffer, "WF200 init successful\r\nFW version %d.%d.%d\r\n", 
            wifi.firmware_major,
            wifi.firmware_minor,
            wifi.firmware_build);
    break;
  case SL_STATUS_WIFI_INVALID_KEY:
    sprintf(pcWriteBuffer, "Failed to init WF200: Firmware keyset invalid\r\n");
    break;
  case SL_STATUS_WIFI_FIRMWARE_DOWNLOAD_TIMEOUT:
    sprintf(pcWriteBuffer, "Failed to init WF200: Firmware download timeout\r\n");
    break;
  case SL_STATUS_TIMEOUT:
    sprintf(pcWriteBuffer, "Failed to init WF200: Poll for value timeout\r\n");
    break;
  case SL_STATUS_FAIL:
    sprintf(pcWriteBuffer, "Failed to init WF200: Error\r\n");
    break;
  default :
    sprintf(pcWriteBuffer, "Failed to init WF200: Unknown error\r\n");
  }

  return pdFALSE;
}

static portBASE_TYPE prvScanCommand(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString)
{
  sl_status_t status;
  *pcWriteBuffer = 0;
  
  printf("!  # Ch RSSI MAC (BSSID)        Network (SSID)\r\n");
  xEventGroupClearBits(sl_wfx_event_group, SL_WFX_SCAN_COMPLETE);
  status = sl_wfx_send_scan_command(WFM_SCAN_MODE_ACTIVE, NULL, 0, NULL, 0, NULL, 0, NULL);
  
  if(status == SL_STATUS_OK)
  {
    if(xEventGroupWaitBits(sl_wfx_event_group, SL_WFX_SCAN_COMPLETE, pdTRUE, pdTRUE, 5000/portTICK_PERIOD_MS) == 0)
    {
      sprintf(pcWriteBuffer, "Command timeout\r\n");
    }
  }else{
    sprintf(pcWriteBuffer, "Command error\r\n");
  }
  
  return pdFALSE;
}

static portBASE_TYPE prvNetworkUpCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString )
{
  sl_status_t status;
  *pcWriteBuffer = 0;
  
  xEventGroupClearBits(sl_wfx_event_group, SL_WFX_CONNECT);
  status = sl_wfx_send_join_command((uint8_t*) wlan_ssid, strlen(wlan_ssid), NULL, 0, wlan_security, 1, 0, (uint8_t*) wlan_passkey, strlen(wlan_passkey), NULL, 0);
  
  if(status == SL_STATUS_OK)
  {
    if(xEventGroupWaitBits(sl_wfx_event_group, SL_WFX_CONNECT, pdTRUE, pdTRUE, 5000/portTICK_PERIOD_MS) == 0)
    {
      sprintf(pcWriteBuffer, "Command timeout\r\n");
    }
    lwip_set_sta_link_up();
  }else{
    sprintf(pcWriteBuffer, "Command error\r\n");
  }
  
  return pdFALSE;
}

static portBASE_TYPE prvNetworkDownCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString )
{
  sl_status_t status;
  *pcWriteBuffer = 0;
  
  lwip_set_sta_link_down();
  
  xEventGroupClearBits(sl_wfx_event_group, SL_WFX_DISCONNECT);
  status = sl_wfx_send_disconnect_command();
  
  if(status == SL_STATUS_OK)
  {
    if(xEventGroupWaitBits(sl_wfx_event_group, SL_WFX_DISCONNECT, pdTRUE, pdTRUE, 5000/portTICK_PERIOD_MS) == 0)
    {
      sprintf(pcWriteBuffer, "Command timeout\r\n");
    }
  }else{
    sprintf(pcWriteBuffer, "Command error\r\n");
  }

  return pdFALSE;
}

static portBASE_TYPE prvSoftApUpCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString )
{
  sl_status_t status;
  *pcWriteBuffer = 0;
  
  xEventGroupClearBits(sl_wfx_event_group, SL_WFX_START_AP);
  status = sl_wfx_start_ap_command(softap_channel, (uint8_t*) softap_ssid, strlen(softap_ssid), 0, 0, softap_security, 0, (uint8_t*) softap_passkey, strlen(softap_passkey), NULL, 0, NULL, 0);
  
  if(status == SL_STATUS_OK)
  {
    if(xEventGroupWaitBits(sl_wfx_event_group, SL_WFX_START_AP, pdTRUE, pdTRUE, 5000/portTICK_PERIOD_MS) == 0)
    {
      sprintf(pcWriteBuffer, "Command timeout\r\n");
    }
    lwip_set_ap_link_up();
  }else{
    sprintf(pcWriteBuffer, "Command error\r\n");
  }

  return pdFALSE;
}

static portBASE_TYPE prvSoftApDownCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString )
{
  sl_status_t status;
  *pcWriteBuffer = 0;
  
  lwip_set_ap_link_down();
  
  xEventGroupClearBits(sl_wfx_event_group, SL_WFX_STOP_AP);
  status = sl_wfx_stop_ap_command();
  
  if(status == SL_STATUS_OK)
  {
    if(xEventGroupWaitBits(sl_wfx_event_group, SL_WFX_STOP_AP, pdTRUE, pdTRUE, 5000/portTICK_PERIOD_MS) == 0)
    {
      sprintf(pcWriteBuffer, "Command timeout\r\n");
    }
  }else{
    sprintf(pcWriteBuffer, "Command error\r\n");
  }

