SiliconLabs/wfx-fullMAC-tools/Examples/STM32/uart_cli/Src/sl_wfx_cli/sl_wfx_cli.c
  return pdFALSE;
}

static portBASE_TYPE prvRssiCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString )
{
  sl_status_t status;
  char *mac_address_string;
  char *mac_byte = NULL;
  sl_wfx_mac_address_t mac_address;
  portBASE_TYPE mac_length;
  *pcWriteBuffer = 0;
  const char separator[1] = ":";
  uint32_t rcpi;
  
  mac_address_string = (char*) FreeRTOS_CLIGetParameter(pcCommandString, 1, &mac_length);
  
  if(mac_length == 0)
  {
    status = sl_wfx_get_signal_strength(&rcpi);
    if(status == SL_STATUS_OK)
    {
      sprintf(pcWriteBuffer, "RSSI value : %d dBm\r\n", (int16_t)(rcpi - 220)/2);
    }else{
      sprintf(pcWriteBuffer, "Command error\r\n");
    }
  }else{
    mac_byte = strtok(mac_address_string, separator);
    mac_address.octet[0] = (uint8_t)strtoul(mac_byte, NULL, 16);
    for(uint8_t i = 1; i < 6; i++)
    {
      mac_byte = strtok(NULL, separator);
      mac_address.octet[i] = (uint8_t)strtoul(mac_byte, NULL, 16);
    }
    status = sl_wfx_get_ap_client_signal_strength(&mac_address , &rcpi);
    if(status == SL_STATUS_OK)
    {
      sprintf(pcWriteBuffer, "Client %02X:%02X:%02X:%02X:%02X:%02X RSSI value : %d dBm\r\n",
              mac_address.octet[0],
              mac_address.octet[1],
              mac_address.octet[2],
              mac_address.octet[3],
              mac_address.octet[4],
              mac_address.octet[5],
              (int16_t)(rcpi - 220)/2);
    }else{
      sprintf(pcWriteBuffer, "Command error\r\n");
    }
  }
  
  return pdFALSE;
}

static portBASE_TYPE prvIPerfCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString )
{
  char *mode, *ip_address;
  portBASE_TYPE mode_length, ip_address_length;
  ip_addr_t client_address;
  *pcWriteBuffer = 0;
  
  mode = (char*) FreeRTOS_CLIGetParameter(pcCommandString, 1, &mode_length);
  ip_address = (char*) FreeRTOS_CLIGetParameter(pcCommandString, 2, &ip_address_length);
  
  mode[mode_length] = 0x00; 
  ip_address[ip_address_length] = 0x00;
  
  if (strcmp(mode, "-s") == 0) 
  {
    lwiperf_start_tcp_server_default(lwip_iperf_results,0);
    sprintf(pcWriteBuffer, "iPerf TCP server started\r\n");
  }else if(strcmp(mode, "-c") == 0) 
  {
    ipaddr_aton(ip_address, &client_address);
    lwiperf_start_tcp_client_default(&client_address, lwip_iperf_results, 0);
    sprintf(pcWriteBuffer, "iPerf TCP client started on server %s\r\n", ip_address);
  }else{
    sprintf(pcWriteBuffer, "Invalid parameter\r\n");
  }
  
  return pdFALSE;
}

static portBASE_TYPE prvPowerManagementModeCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString )
{
  sl_status_t status;
  char *power_mode, *interval;
  portBASE_TYPE power_mode_length, interval_length;
  *pcWriteBuffer = 0;
  
  /* Retrieve command parameters */
  power_mode = (char*) FreeRTOS_CLIGetParameter(pcCommandString, 1, &power_mode_length);
  interval = (char*) FreeRTOS_CLIGetParameter(pcCommandString, 2, &interval_length);
  
  /* End the string parameters*/
  power_mode[power_mode_length] = 0x00;
  interval[interval_length] = 0x00;
  
  if(atoi(power_mode) == 0)
  {
    status = sl_wfx_set_power_mode(WFM_PM_MODE_ACTIVE, 0);
    if(status == SL_STATUS_OK)
    {
      sprintf(pcWriteBuffer, "Power mode disable \r\n");
    }else{
      sprintf(pcWriteBuffer, "Command error\r\n");
    }
  }else{
    status = sl_wfx_set_power_mode((sl_wfx_pm_mode_t) atoi(power_mode), (uint16_t) atoi(interval) );
    if(status == SL_STATUS_OK)
    {
      sprintf(pcWriteBuffer, "Power mode %d, interval %d\r\n", atoi(power_mode), atoi(interval));
    }else{
      sprintf(pcWriteBuffer, "Command error\r\n");
    }
  }

  return pdFALSE;
}

static portBASE_TYPE prvDevicePowerSaveCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString )
{
  sl_status_t status;
  char *state;
  portBASE_TYPE state_length;
  *pcWriteBuffer = 0;

  /* Retrieve command parameters */
  state = (char*) FreeRTOS_CLIGetParameter(pcCommandString, 1, &state_length);
  
  /* End the string parameters*/
  state[state_length] = 0x00;
  
  if(strcmp(state, "on") == 0)
  {
    status = sl_wfx_enable_device_power_save();
    if(status == SL_STATUS_OK)
    {
      sprintf(pcWriteBuffer, "Enable device power save\r\n");
    }else{
      sprintf(pcWriteBuffer, "Command error\r\n");
    }
  }else if(strcmp(state, "off") == 0)
  {
    status = sl_wfx_disable_device_power_save();
    if(status == SL_STATUS_OK)
    {
      sprintf(pcWriteBuffer, "Disable device power save\r\n");
    }else{
      sprintf(pcWriteBuffer, "Command error\r\n");
    }
  }else{
    sprintf(pcWriteBuffer, "Invalid parameter\r\n");
  }
  
  return pdFALSE;
}

static portBASE_TYPE prvShutdownCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString )
{
  sl_status_t status;
  *pcWriteBuffer = 0;
  
  status = sl_wfx_shutdown();
  if(status == SL_STATUS_OK)
  {
    sprintf(pcWriteBuffer, "Wi-Fi chip shutdown\r\n");
  }else{
    sprintf(pcWriteBuffer, "Command error\r\n");
  }
  return pdFALSE;
}

static portBASE_TYPE prvResetCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString )
{
  *pcWriteBuffer = 0;

  printf("Reset the MCU\r\n");
  HAL_NVIC_SystemReset();
  
  return pdFALSE;
}

static portBASE_TYPE prvGetCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString )
{
  char* parameter;
  portBASE_TYPE parameter_length;
  *pcWriteBuffer = 0;
  
  /* Retrieve command parameters */
  parameter = (char*) FreeRTOS_CLIGetParameter(pcCommandString, 1, &parameter_length);
  
  /* End the string parameters*/
  parameter[ parameter_length ] = 0x00;
  
  /* Compare the parameter to the available settings and return the current value */
  if (strcmp(parameter, "state") == 0){
    sprintf(pcWriteBuffer,
            "Initialized          :%c\r\n"
            "Connected as station :%c\r\n"
            "SoftAP up            :%c\r\n"
            "Sleeping             :%c\r\n"
            "Powersave enabled    :%c\r\n"
            , SL_WFX_STATE_TO_BINARY(wifi.state));
  }
  /* WLAN */
  else if (strcmp(parameter, "wlan.all") == 0) 
  {
    sprintf(pcWriteBuffer, 
            "wlan.ssid     = %s\r\n"
            "wlan.passkey  = %s\r\n"
            "wlan.security = %d\r\n"
            "wlan.mac      = %02X:%02X:%02X:%02X:%02X:%02X\r\n"
            "wlan.ip       = %d.%d.%d.%d\r\n",
            wlan_ssid,
            wlan_passkey,
            wlan_security,
            sl_wfx_context->mac_addr_0.octet[0],
            sl_wfx_context->mac_addr_0.octet[1],
            sl_wfx_context->mac_addr_0.octet[2],
            sl_wfx_context->mac_addr_0.octet[3],
            sl_wfx_context->mac_addr_0.octet[4],
            sl_wfx_context->mac_addr_0.octet[5],
            sta_netif.ip_addr.addr & 0xff,
            (sta_netif.ip_addr.addr >> 8) & 0xff,
            (sta_netif.ip_addr.addr >> 16) & 0xff,
            (sta_netif.ip_addr.addr >> 24) & 0xff);
  } 
  else if (strcmp(parameter, "wlan.ssid") == 0) 
  {
    sprintf(pcWriteBuffer, "%s\r\n", wlan_ssid);
  } 
  else if (strcmp(parameter, "wlan.passkey") == 0 )
  {
    sprintf(pcWriteBuffer, "%s\r\n", wlan_passkey);
  }
  else if (strcmp(parameter, "wlan.security") == 0 )
  {
    if(wlan_security == WFM_SECURITY_MODE_OPEN)                sprintf(pcWriteBuffer, "OPEN\r\n");
    else if(wlan_security == WFM_SECURITY_MODE_WEP)            sprintf(pcWriteBuffer, "WEP\r\n");
    else if(wlan_security == WFM_SECURITY_MODE_WPA2_WPA1_PSK)  sprintf(pcWriteBuffer, "WPA1/WPA2\r\n");
    else if(wlan_security == WFM_SECURITY_MODE_WPA2_PSK)       sprintf(pcWriteBuffer, "WPA2\r\n");
  }
  else if (strcmp(parameter, "wlan.mac") == 0 )
  {
    sprintf(pcWriteBuffer, 
            "%02X:%02X:%02X:%02X:%02X:%02X\r\n", 
            sl_wfx_context->mac_addr_0.octet[0],
            sl_wfx_context->mac_addr_0.octet[1],
            sl_wfx_context->mac_addr_0.octet[2],
            sl_wfx_context->mac_addr_0.octet[3],
            sl_wfx_context->mac_addr_0.octet[4],
            sl_wfx_context->mac_addr_0.octet[5]);
  }
  else if (strcmp(parameter, "wlan.ip") == 0 )
  {
    sprintf(pcWriteBuffer,
            "IP address : %d.%d.%d.%d\r\n",
            sta_netif.ip_addr.addr & 0xff,
            (sta_netif.ip_addr.addr >> 8) & 0xff,
            (sta_netif.ip_addr.addr >> 16) & 0xff,
            (sta_netif.ip_addr.addr >> 24) & 0xff);
  }
  /* SOFTAP */
  else if (strcmp(parameter, "softap.all") == 0) 
  {
    sprintf(pcWriteBuffer, 
            "softap.ssid     = %s\r\n"
            "softap.passkey  = %s\r\n"
            "softap.security = %d\r\n"
            "softap.mac      = %02X:%02X:%02X:%02X:%02X:%02X\r\n"
            "softap.ip       = %d.%d.%d.%d\r\n"
            "softap.channel  = %d\r\n",
            softap_ssid,
            softap_passkey,
            softap_security,
            sl_wfx_context->mac_addr_1.octet[0],
            sl_wfx_context->mac_addr_1.octet[1],
            sl_wfx_context->mac_addr_1.octet[2],
            sl_wfx_context->mac_addr_1.octet[3],
            sl_wfx_context->mac_addr_1.octet[4],
            sl_wfx_context->mac_addr_1.octet[5],
            ap_netif.ip_addr.addr & 0xff,
            (ap_netif.ip_addr.addr >> 8) & 0xff,
            (ap_netif.ip_addr.addr >> 16) & 0xff,
            (ap_netif.ip_addr.addr >> 24) & 0xff,
            softap_channel);
  } 
  else if (strcmp(parameter, "softap.ssid") == 0 )
  {
    sprintf(pcWriteBuffer, "%s\r\n", softap_ssid);
  }
  else if (strcmp(parameter, "softap.passkey") == 0 )
  {
    sprintf(pcWriteBuffer, "%s\r\n", softap_passkey);
  }
  else if (strcmp(parameter, "softap.security") == 0 )
  {
    if(softap_security == WFM_SECURITY_MODE_OPEN)                sprintf(pcWriteBuffer, "OPEN\r\n");
    else if(softap_security == WFM_SECURITY_MODE_WEP)            sprintf(pcWriteBuffer, "WEP\r\n");
    else if(softap_security == WFM_SECURITY_MODE_WPA2_WPA1_PSK)  sprintf(pcWriteBuffer, "WPA1/WPA2\r\n");
    else if(softap_security == WFM_SECURITY_MODE_WPA2_PSK)       sprintf(pcWriteBuffer, "WPA2\r\n");
  }
  else if (strcmp(parameter, "softap.channel") == 0 )
  {
    sprintf(pcWriteBuffer, "%d\r\n", softap_channel);
  }
  else if (strcmp(parameter, "softap.mac") == 0 )
  {
    sprintf(pcWriteBuffer, 
            "%02X:%02X:%02X:%02X:%02X:%02X\r\n", 
            sl_wfx_context->mac_addr_1.octet[0],
            sl_wfx_context->mac_addr_1.octet[1],
            sl_wfx_context->mac_addr_1.octet[2],
            sl_wfx_context->mac_addr_1.octet[3],
            sl_wfx_context->mac_addr_1.octet[4],
            sl_wfx_context->mac_addr_1.octet[5]);
  }
  else if (strcmp(parameter, "softap.ip") == 0 )
  {
    sprintf(pcWriteBuffer,
            "IP address : %d.%d.%d.%d\r\n",
            ap_netif.ip_addr.addr & 0xff,
            (ap_netif.ip_addr.addr >> 8) & 0xff,
            (ap_netif.ip_addr.addr >> 16) & 0xff,
            (ap_netif.ip_addr.addr >> 24) & 0xff);
  }
  else if (strcmp(parameter, "softap.clients") == 0 )
  {
  }
  else if (strcmp(parameter, "iperf") == 0 )
  {
    sprintf(pcWriteBuffer, 
            "\r\nIperf Client Report:\r\n"
            "Duration %dms\r\n"
            "Bytes transferred %d\r\n"
            "%d kbit/s\r\n",
            iperf_ms_duration,
            iperf_bytes_transferred,
            iperf_bandwidth_kbitpsec);
  }
  else if (strcmp(parameter, "ip.stats") == 0 )
  {
    stats_display();
  }
  else if (strcmp(parameter, "help") == 0 )
  {
    sprintf(pcWriteBuffer, 
            "state          : value of the context state\r\n"
            "wlan.all       : all the wlan.* parameter\r\n"
            "wlan.ssid      : wlan ssid used\r\n"
            "wlan.passkey   : wlan passkey used\r\n"
            "wlan.security  : wlan security level used\r\n"
            "wlan.mac       : wlan MAC address\r\n"
            "wlan.ip        : wlan IP address\r\n"
            "softap.all     : all the softap.* parameter\r\n"
            "softap.ssid    : softAP ssid used\r\n"
            "softap.passkey : softAP passkey used\r\n"
            "softap.security: softAP security level used\r\n"
            "softap.channel : channel used in softAP mode\r\n"
            "softap.mac     : softAP MAC address\r\n"
            "softap.clients : List clients connected to the softAP\r\n"
            "iperf          : return latest iPerf restuls\r\n"
            "ip.stats       : display the IP stack stats\r\n");
  }
  else /* default: */
  {
    sprintf(pcWriteBuffer, "Invalid parameter\r\n");
  }

