SiliconLabs/wfx-fullMAC-tools/Examples/STM32/uart_cli/Src/sl_wfx_cli/sl_wfx_cli.c
  return pdFALSE;
}

static portBASE_TYPE prvSetCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString )
{
  char *parameter, *value;
  portBASE_TYPE parameter_length, value_length;
  *pcWriteBuffer = 0;
  
  /* Retrieve command parameters */
  parameter = (char*) FreeRTOS_CLIGetParameter(pcCommandString, 1, &parameter_length);
  value = (char*) FreeRTOS_CLIGetParameter(pcCommandString, 2, &value_length);
  
  /* End the string parameters*/
  parameter[parameter_length] = 0x00;
  value[value_length] = 0x00;
  
  /* Compare the parameter to the available settings and return the current value */
  /* WLAN */
  if (strcmp(parameter, "wlan.ssid") == 0) 
  {
    strcpy(wlan_ssid, value);
    sprintf(pcWriteBuffer, "wlan.ssid = %s\r\n", wlan_ssid);
  } 
  else if (strcmp(parameter, "wlan.passkey") == 0 )
  {
    if(strlen(value) < 8)
    {
      sprintf(pcWriteBuffer, "Passkey parameter invalid, valid length range = [8;63]\r\n");
    }else{
      strcpy(wlan_passkey, value);
      sprintf(pcWriteBuffer, "wlan.passkey = %s\r\n", wlan_passkey);
    }
  }
  else if (strcmp(parameter, "wlan.security") == 0 )
  {
    sprintf(pcWriteBuffer, "wlan.security = %s\r\n", value);
    if(strcmp(value, "OPEN") == 0)           wlan_security = WFM_SECURITY_MODE_OPEN;
    else if(strcmp(value, "WEP") == 0)       wlan_security = WFM_SECURITY_MODE_WEP;
    else if(strcmp(value, "WPA1/WPA2") == 0) wlan_security = WFM_SECURITY_MODE_WPA2_WPA1_PSK;
    else if(strcmp(value, "WPA2") == 0)      wlan_security = WFM_SECURITY_MODE_WPA2_PSK;
    else sprintf(pcWriteBuffer, "Invalid parameter. Valid options: OPEN, WEP, WPA1/WPA2, WPA2\r\n");
  }
  else if (strcmp(parameter, "wlan.mac") == 0 )
  {
    sprintf(pcWriteBuffer, "Not supported\r\n");
  }
  /* SOFTAP */
  else if (strcmp(parameter, "softap.ssid") == 0 )
  {
    strcpy(softap_ssid, value);
    sprintf(pcWriteBuffer, "softap.ssid = %s\r\n", softap_ssid);
  }
  else if (strcmp(parameter, "softap.passkey") == 0 )
  {
    if(strlen(value) < 8)
    {
      sprintf(pcWriteBuffer, "Passkey parameter invalid, valid length range = [8;63]\r\n");
    }else{
      strcpy(softap_passkey, value);
      sprintf(pcWriteBuffer, "softap.passkey = %s\r\n", softap_passkey);
    }
  }
  else if (strcmp(parameter, "softap.security") == 0 )
  {
    sprintf(pcWriteBuffer, "softap.security = %s\r\n", value);
    if(strcmp(value, "OPEN") == 0)           softap_security = WFM_SECURITY_MODE_OPEN;
    else if(strcmp(value, "WEP") == 0)       softap_security = WFM_SECURITY_MODE_WEP;
    else if(strcmp(value, "WPA1/WPA2") == 0) softap_security = WFM_SECURITY_MODE_WPA2_WPA1_PSK;
    else if(strcmp(value, "WPA2") == 0)      softap_security = WFM_SECURITY_MODE_WPA2_PSK;
    else sprintf(pcWriteBuffer, "Invalid parameter. Valid options: OPEN, WEP, WPA1/WPA2, WPA2\r\n");
  }
  else if (strcmp(parameter, "softap.channel") == 0 )
  {
    uint8_t channel = (uint8_t) atoi(value);
    if((channel < 1) || (channel > 13))
    {
      sprintf(pcWriteBuffer, "Channel parameter invalid, valid range = [1;13]\r\n");
    }else{
      softap_channel = channel;
      sprintf(pcWriteBuffer, "softap.channel = %d\r\n", softap_channel);
    }
  }
  else if (strcmp(parameter, "softap.mac") == 0 )
  {
    sprintf(pcWriteBuffer, "Not supported\r\n");
  }
  else if (strcmp(parameter, "help") == 0 )
  {
    sprintf(pcWriteBuffer, 
            "wlan.ssid      : wlan ssid used\r\n"
            "wlan.passkey   : wlan passkey used, range [8;63]\r\n"
            "wlan.security  : wlan security level used (OPEN,WEP,WPA1/WPA2,WPA2)\r\n"
            "wlan.mac       : not supported\r\n"
            "softap.ssid    : softAP ssid used\r\n"
            "softap.passkey : softAP passkey used, range [8;63]\r\n"
            "softap.security: softAP security level used (OPEN,WEP,WPA1/WPA2,WPA2)\r\n"
            "softap.channel : channel used in softAP mode, range [1;14]\r\n"
            "softap.mac     : not supported\r\n");
  }
  else /* default: */
  {
    sprintf(pcWriteBuffer, "Invalid parameter\r\n");
  }

  return pdFALSE;
}
